tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/system/ProbeData
// -*- C++ -*-

Volume1_v_CPU
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    log             true;
    valueOutput     false;
    regionType      cellZone;
    name            v_CPU;
    region          v_CPU;
    operation       volAverage;
    fields          ( T );
    writeFields     false;
}

Volume2_v_CPU
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    log             true;
    valueOutput     false;
    regionType      cellZone;
    name            v_CPU;
    region          v_CPU;
    operation       min;
    fields          ( T );
    writeFields     false;
}

Volume3_v_fins
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    log             true;
    valueOutput     false;
    regionType      cellZone;
    name            v_fins;
    region          v_fins;
    operation       volAverage;
    fields          ( T );
    writeFields     false;
}

Volume4_v_fins
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    log             true;
    valueOutput     false;
    regionType      cellZone;
    name            v_fins;
    region          v_fins;
    operation       min;
    fields          ( T );
    writeFields     false;
}

MonitorPart_1
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    surfaceFormat   null;
    region          domain0;
    log             true;
    valueOutput     true;
    source          patch;
    regionType      patch;
    name            OUTLET_01;
    operation       areaAverage;
    fields          ( U T );
    writeFields     false;
}

// ************************************************************************* //
